# About Libgcrypt 1.6 performance
#+AUTHOR: Werner
#+DATE: 12th May 2014

** Goteo Campaign: Preliminary Results

   Here is a quick status update: The t-shirts arrived as expected the
   week after Eastern.  Mechthilde, Michael, Penny, Rainer, and me met
   the other day at the FSFE office in Düsseldorf and due Rainer's
   excellent preparation we quickly folded, enveloped, and stamped
   about 300 t-shirts and posted them.  Kudos to them for helping with
   this task.  There are still a few t-shirts we have not been able to
   sent because some of our contributors did not reply to several
   mails asking for missing address details, or the postmaster
   returned them due to faulty snail addresses.  If you expected a
   t-shirt and did not received one, please contact me at accounts at
   GnuPG dot net.  Most of the stickers have also been snailed but a
   few are still pending due to uncertain addresses.

   The main [[https://www.gnupg.org][GnuPG site]] is now accessible via TLS and plain http access
   is redirected to the https address.  Strict Transport Security
   (HSTS) has also been enabled.  In the case of problems with TLS the
   site may still be accessed non-encrypted via
   [[http://www.tla-friendly.gnupg.org]].

   To accomplish another promise of the campaign, the GnuPG website may
   now be accessed as TOR hidden service at
   [[http://ic6au7wa3f6naxjq.onion]]. Being a well known and intentionally
   public site, it does not make much sense to have it as a hidden
   service but if the site is to be accessed anyway via Tor we can
   avoid the extra TLS layer and and allow direct access.  Note that
   lists.gnupg.org and some other services are not available via an
   onion address.

   Finally here are preliminary financial results of the campaign:

    Our contributors donated a total of 37270 Euro. Due to card and
    Paypal processing problems we actually received 36732 Euro.  The
    preliminary costs for running the campaign are 18590 Euros, so
    that 18142 Euro are available for the goals.  Here is an overview
    of the costs:

#+ATTR_HTML: :cellpadding 2
    |                              |       |
    |------------------------------+-------|
    | Goteo fee                    |  2939 |
    | Paypal fees                  |  1152 |
    | VAT                          |  5212 |
    | Campaign manager             |  5390 |
    | 300 t-shirts                 |  1852 |
    | Envelopes + postage t-shirts |   996 |
    | Rewards for helper           |   102 |
    | 360 Stickers                 |   342 |
    | Envelopes + postage sticker  |   210 |
    | Campaign server for 5 months |   395 |
    |------------------------------+-------|
    |                              | 18590 |
    #+TBLFM: $LR2=vsum(@I..@II)
    # (VAT computed after Goteo and Paypal fees from 32641)

    Due to missing or incomplete addresses or no response to our mails
    we could not ship about 80 stickers and 15 t-shirts.  I spend a
    substantial amount of time (at least 4 weeks) with direct campaign
    related tasks, which were not included in the original plan.  That
    plan explained how to spend the money:

#+ATTR_HTML: :cellpadding 2
    |                    |       |
    |--------------------+-------|
    | New website        |  4054 |
    | New content        |   910 |
    | New website design |  1435 |
    | Releasing 2.1      |  6000 |
    |--------------------+-------|
    |                    | 12399 |
    #+TBLFM: $LR2=vsum(@I..@II)

    The extra 5743 Euro we received will be used for general
    maintenance, to cover the unexpected time I had to spend on the
    campaign, and for some giveaways to long time GnuPG hackers.

    Thank you very much for all your help and please keep on
    supporting GnuPG.
